zephyrproject-rtos/hal_renesas/drivers/rx/rdp/src/r_riic_rx/src/targets/rx14t/r_riic_rx14t.c
/***********************************************************************************************************************
 * Function Name: riic_mcu_int_icier_setting
 * Description  : Time out interrupt enable bit setting.
 * Arguments    : uint8_t channel
 *              : uint8_t New_icier       ; New ICIER value
 * Return Value : None
 **********************************************************************************************************************/
void riic_mcu_int_icier_setting (uint8_t channel, uint8_t New_icier)
{
    volatile uint8_t uctmp = 0x00;

    /* Channel number? */
    switch (channel)
    {
#if (1U == RIIC_CFG_CH0_INCLUDED)
        case 0x00 : /* Channel 0 */
#if (1U == RIIC_CFG_CH0_TMO_ENABLE)
            RIIC0.ICIER.BYTE = (New_icier | RIIC_ICIER_TMO);
            uctmp            = RIIC0.ICIER.BYTE; /* Reads ICIER. */
#else
            RIIC0.ICIER.BYTE = New_icier;
            uctmp = RIIC0.ICIER.BYTE; /* Reads ICIER. */
#endif
            break;
#endif

        default :

            /* Please add a channel as needed. */
            break;
    }
} /* End of function riic_mcu_int_icier_setting() */

/***********************************************************************************************************************
 * Function Name: riic_mcu_int_enable
 * Description  : Clears interrupt request register.
 *              : Enables interrupt.
 * Arguments    : uint8_t channel
 * Return Value : None
 **********************************************************************************************************************/
void riic_mcu_int_enable (uint8_t channel)
{
    volatile uint8_t uctmp = 0x00;

    /* Channel number? */
    switch (channel)
    {
#if (1U == RIIC_CFG_CH0_INCLUDED)
        case 0x00 : /* Channel 0 */

            /* Enables interrupt. */
            RIIC_IER_EEI0 = RIIC_IER_ENABLE; /* Enables EEI0 interrupt request enable register. */
            RIIC_IER_RXI0 = RIIC_IER_ENABLE; /* Enables RXI0 interrupt request enable register. */
            RIIC_IER_TXI0 = RIIC_IER_ENABLE; /* Enables TXI0 interrupt request enable register. */
            RIIC_IER_TEI0 = RIIC_IER_ENABLE; /* Enables TEI0 interrupt request enable register. */

            /* Sets interrupt source priority. */
            RIIC_IPR_EEI0 = RIIC_IPR_CH0_EEI_SET; /* Sets EEI0 interrupt source priority register. */
            RIIC_IPR_RXI0 = RIIC_IPR_CH0_RXI_SET; /* Sets RXI0 interrupt source priority register. */
            RIIC_IPR_TXI0 = RIIC_IPR_CH0_TXI_SET; /* Sets TXI0 interrupt source priority register. */
            RIIC_IPR_TEI0 = RIIC_IPR_CH0_TEI_SET; /* Sets TEI0 interrupt source priority register. */
            uctmp         = RIIC_IER_TEI0; /* Reads IER. */
            break;
#endif

        default :

            /* Please add a channel as needed. */
            break;
    }
} /* End of function riic_mcu_int_enable() */

/***********************************************************************************************************************
 * Function Name: riic_mcu_int_disable
 * Description  : Disables interrupt.
 *              : Sets interrupt source priority.
 *              : Clears interrupt request register.
 * Arguments    : uint8_t channel
 * Return Value : None
 **********************************************************************************************************************/
void riic_mcu_int_disable (uint8_t channel)
{
    volatile uint8_t uctmp = 0x00;

    /* Channel number? */
    switch (channel)
    {
#if (1U == RIIC_CFG_CH0_INCLUDED)
        case 0U : /* Channel 0 */

            /* Disables interrupt. */
            RIIC_IER_EEI0 = RIIC_IER_DISABLE; /* Disables EEI0 interrupt request enable register. */
            RIIC_IER_RXI0 = RIIC_IER_DISABLE; /* Disables RXI0 interrupt request enable register. */
            RIIC_IER_TXI0 = RIIC_IER_DISABLE; /* Disables TXI0 interrupt request enable register. */
            RIIC_IER_TEI0 = RIIC_IER_DISABLE; /* Disables TEI0 interrupt request enable register. */

            /* Sets interrupt source priority. */
            RIIC_IPR_EEI0 = RIIC_IPR_CH0_EEI_INIT; /* Sets EEI0 interrupt source priority register. */
            RIIC_IPR_RXI0 = RIIC_IPR_CH0_RXI_INIT; /* Sets RXI0 interrupt source priority register. */
            RIIC_IPR_TXI0 = RIIC_IPR_CH0_TXI_INIT; /* Sets TXI0 interrupt source priority register. */
            RIIC_IPR_TEI0 = RIIC_IPR_CH0_TEI_INIT; /* Sets TEI0 interrupt source priority register. */
            uctmp         = RIIC_IPR_TEI0; /* Reads IPR. */
            break;
#endif

        default :

            /* Please add a channel as needed. */
            break;
    }
} /* End of function riic_mcu_int_disable() */

/***********************************************************************************************************************
 * Function Name: riic_mcu_check_freq
 * Description  : check pclk frequency and return that value.
 * Arguments    : None
 * Return Value : PCLK frequency
 **********************************************************************************************************************/
double riic_mcu_check_freq (void)
{
    return BSP_PCLKB_HZ;
} /* End of function riic_mcu_check_freq() */

    #if (1U == RIIC_CFG_CH0_INCLUDED)
/***********************************************************************************************************************
 * Function Name: riic0_eei_isr
 * Description  : Interrupt EEI handler for channel 0.
 *                Types of interrupt requests transfer error or event generation.
 *                The event generations are arbitration-lost, NACK detection, timeout detection, 
 *                start condition detection, and stop condition detection.
 * Arguments    : None
 * Return Value : None
 **********************************************************************************************************************/
R_BSP_PRAGMA_STATIC_INTERRUPT(riic0_eei_isr, VECT(RIIC0, EEI0))
R_BSP_ATTRIB_STATIC_INTERRUPT void riic0_eei_isr (void)
{
    riic0_eei_sub();
} /* End of function riic0_eei_isr() */

